-- Прикладная задача: Найдите всех пассажиров, которые сидели в первых десяти рядах (с 1 по 10),
-- а также подсчитайте, сколько билетов у каждого из них. Результат должен быть отсортирован по количеству бронирований.
-- Для пассажиров, у которых более одного билета, выведите также номер их последнего бронирования.
-- Вывести их контактные данные, причём сначала тех, у кого есть email.

-- Эта задача может быть полезной для службы безопасности, чтобы быстро идентифицировать
-- пассажиров, которые с большой вероятностью являются членами одной группы (например, семья или бизнес-делегация),
-- так как они часто бронируют несколько билетов на одно и то же имя и места рядом.
-- Эта информация также может использоваться для адресной рассылки предложений или бонусов.

SELECT
    t.passenger_name,
    t.contact_data -> 'phone' AS phone,
    t.contact_data -> 'email' AS email,
    count(t.book_ref) AS total_bookings
FROM tickets t
    JOIN boarding_passes bp USING (ticket_no)
WHERE
    SUBSTRING(
        bp.seat_no
        FROM '^[0-9]+'
    )::INTEGER BETWEEN 1 AND 10
GROUP BY
    t.passenger_name,
    t.contact_data
ORDER BY (t.contact_data -> 'email') IS NULL;